# 第二次上机作业 最小二乘法实现线性回归

import numpy as np

X = np.array([[39, 567, 10000,2, 0.2,  ],
              [37, 679, 0,    3, 0.15,],
              [30, 346, 5000, 3, 0.1,  ],
              [25, 987, 5000, 3, 0.08, ],
              [25, 1101, 0,   4, 0.07, ],
              [10, 1004,5000, 5, 0.07, ],
              [15, 667,  0,   4, 0.05, ],
              [5,  604, 10000,6, 0.04, ]])

y = np.array([75, 68, 105, 136, 152, 191, 148, 234])

xi = np.linalg.inv(np.transpose(X) @ X) @ np.transpose(X) @ np.transpose(y)
print(xi)